{{- if eq .chezmoi.os "darwin" -}}
# To pin a fast-moving package, replace `brew "uv"` with `brew "uv@<version>"`
# once a tap exists, or vendor via `brew extract`. Pin only on regression —
# default is unpinned.

# Third-party taps
tap "nikitabobko/tap"   # aerospace

# CLI essentials
brew "git"
brew "gh"
brew "jq"
brew "yq"
brew "fzf"
brew "direnv"
brew "zoxide"
brew "starship"
brew "neovim"
brew "tmux"
brew "repomix"  # bundle a repo into a single AI-friendly file (Claude Code companion)

# Zsh enhancements
brew "zsh-autosuggestions"
brew "zsh-fast-syntax-highlighting"
brew "atuin"   # SQLite-backed shell history; see dot_config/atuin/config.toml

# Rust-written CLI replacements
brew "ripgrep"
brew "fd"
brew "bat"
brew "eza"

# Rust CLI extras
brew "git-delta"
brew "dust"
brew "tokei"
brew "hyperfine"
brew "bottom"
brew "gitui"
brew "just"

# Terminal stack
cask "alacritty"
brew "zellij"

# Editors
cask "zed"

# Dev
brew "uv"
brew "mise"
brew "node"

# Rust toolchain — run `rustup default stable` once after install.
# cargo-binstall is here for crates brew doesn't ship; brew remains the
# default for the Rust CLIs above.
brew "rustup"
brew "cargo-binstall"
{{ if has .chezmoi.hostname .hosts.ai_machines }}
# AI (host-gated)
brew "llama.cpp"
brew "ollama"
brew "whisper-cpp" # local speech-to-text; pairs with mlx for audio→LLM pipelines
brew "asitop"      # Apple Silicon GPU/memory monitor — leaner than btm for inference work
brew "mactop"      # Per-core CPU/GPU + thermal sensors; complements asitop
cask "lm-studio"
{{ end }}
# Productivity
cask "raycast"
cask "nikitabobko/tap/aerospace"  # i3-style tiling (replaces rectangle)
cask "karabiner-elements"  # Caps Lock → Esc on tap / Hyper on hold
cask "1password"
cask "1password-cli"
cask "tailscale-app"
cask "claude"              # Anthropic desktop app — companion to Claude Code
cask "obsidian"            # local-first markdown PKM; vault is plain files
cask "appcleaner"          # clean uninstall — drag app, removes prefs/caches

# Containers
# macOS 26+ ships native OCI container support via /usr/bin/container
# (Apple's Containerization framework). For occasional `container run`
# that's enough — no install needed. Uncomment the cask below if you
# need any of: docker-compose, multi-arch (Rosetta-translated x86
# images), Kubernetes, drop-in `docker` CLI compatibility, or a GUI.
# cask "orbstack"
{{ end -}}
